package Lesson.Seminar.Seminar1;

import java.time.LocalDateTime;

//Настроить проект, вывести в консоль “Hello world!”. 
//Вывести в консоль системные дату и время.

public class begin1 {
    public static void main(String[] args) {
        System.out.println("Hello World");
        System.out.println(LocalDateTime.now());
    }
}
